OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16lf1615.c
__at(0x0890) __sfr AT1CC1H;
__at(0x0890) volatile __AT1CC1Hbits_t AT1CC1Hbits;

__at(0x0891) __sfr AT1CCON1;
__at(0x0891) volatile __AT1CCON1bits_t AT1CCON1bits;

__at(0x0892) __sfr AT1CSEL2;
__at(0x0892) volatile __AT1CSEL2bits_t AT1CSEL2bits;

__at(0x0893) __sfr AT1CC2;

__at(0x0893) __sfr AT1CC2L;
__at(0x0893) volatile __AT1CC2Lbits_t AT1CC2Lbits;

__at(0x0894) __sfr AT1CC2H;
__at(0x0894) volatile __AT1CC2Hbits_t AT1CC2Hbits;

__at(0x0895) __sfr AT1CCON2;
__at(0x0895) volatile __AT1CCON2bits_t AT1CCON2bits;

__at(0x0896) __sfr AT1CSEL3;
__at(0x0896) volatile __AT1CSEL3bits_t AT1CSEL3bits;

__at(0x0897) __sfr AT1CC3;

__at(0x0897) __sfr AT1CC3L;
__at(0x0897) volatile __AT1CC3Lbits_t AT1CC3Lbits;

__at(0x0898) __sfr AT1CC3H;
__at(0x0898) volatile __AT1CC3Hbits_t AT1CC3Hbits;

__at(0x0899) __sfr AT1CCON3;
__at(0x0899) volatile __AT1CCON3bits_t AT1CCON3bits;

__at(0x0D8C) __sfr SMT1TMR;

__at(0x0D8C) __sfr SMT1TMRL;
__at(0x0D8C) volatile __SMT1TMRLbits_t SMT1TMRLbits;

__at(0x0D8D) __sfr SMT1TMRH;
__at(0x0D8D) volatile __SMT1TMRHbits_t SMT1TMRHbits;

__at(0x0D8E) __sfr SMT1TMRU;
__at(0x0D8E) volatile __SMT1TMRUbits_t SMT1TMRUbits;

__at(0x0D8F) __sfr SMT1CPR;

__at(0x0D8F) __sfr SMT1CPRL;
__at(0x0D8F) volatile __SMT1CPRLbits_t SMT1CPRLbits;

__at(0x0D90) __sfr SMT1CPRH;
__at(0x0D90) volatile __SMT1CPRHbits_t SMT1CPRHbits;

__at(0x0D91) __sfr SMT1CPRU;
__at(0x0D91) volatile __SMT1CPRUbits_t SMT1CPRUbits;

__at(0x0D92) __sfr SMT1CPW;

__at(0x0D92) __sfr SMT1CPWL;
__at(0x0D92) volatile __SMT1CPWLbits_t SMT1CPWLbits;

__at(0x0D93) __sfr SMT1CPWH;
__at(0x0D93) volatile __SMT1CPWHbits_t SMT1CPWHbits;

__at(0x0D94) __sfr SMT1CPWU;
__at(0x0D94) volatile __SMT1CPWUbits_t SMT1CPWUbits;

__at(0x0D95) __sfr SMT1PR;

__at(0x0D95) __sfr SMT1PRL;
__at(0x0D95) volatile __SMT1PRLbits_t SMT1PRLbits;

__at(0x0D96) __sfr SMT1PRH;
__at(0x0D96) volatile __SMT1PRHbits_t SMT1PRHbits;

__at(0x0D97) __sfr SMT1PRU;
__at(0x0D97) volatile __SMT1PRUbits_t SMT1PRUbits;

__at(0x0D98) __sfr SMT1CON0;
__at(0x0D98) volatile __SMT1CON0bits_t SMT1CON0bits;

__at(0x0D99) __sfr SMT1CON1;
__at(0x0D99) volatile __SMT1CON1bits_t SMT1CON1bits;

__at(0x0D9A) __sfr SMT1STAT;
__at(0x0D9A) volatile __SMT1STATbits_t SMT1STATbits;

__at(0x0D9B) __sfr SMT1CLK;
__at(0x0D9B) volatile __SMT1CLKbits_t SMT1CLKbits;

__at(0x0D9C) __sfr SMT1SIG;
__at(0x0D9C) volatile __SMT1SIGbits_t SMT1SIGbits;

__at(0x0D9D) __sfr SMT1WIN;
__at(0x0D9D) volatile __SMT1WINbits_t SMT1WINbits;

__at(0x0D9E) __sfr SMT2TMR;

__at(0x0D9E) __sfr SMT2TMRL;
__at(0x0D9E) volatile __SMT2TMRLbits_t SMT2TMRLbits;

__at(0x0D9F) __sfr SMT2TMRH;
__at(0x0D9F) volatile __SMT2TMRHbits_t SMT2TMRHbits;

__at(0x0DA0) __sfr SMT2TMRU;
__at(0x0DA0) volatile __SMT2TMRUbits_t SMT2TMRUbits;

__at(0x0DA1) __sfr SMT2CPR;

__at(0x0DA1) __sfr SMT2CPRL;
__at(0x0DA1) volatile __SMT2CPRLbits_t SMT2CPRLbits;

__at(0x0DA2) __sfr SMT2CPRH;
__at(0x0DA2) volatile __SMT2CPRHbits_t SMT2CPRHbits;

__at(0x0DA3) __sfr SMT2CPRU;
__at(0x0DA3) volatile __SMT2CPRUbits_t SMT2CPRUbits;

__at(0x0DA4) __sfr SMT2CPW;

__at(0x0DA4) __sfr SMT2CPWL;
__at(0x0DA4) volatile __SMT2CPWLbits_t SMT2CPWLbits;

__at(0x0DA5) __sfr SMT2CPWH;
__at(0x0DA5) volatile __SMT2CPWHbits_t SMT2CPWHbits;

__at(0x0DA6) __sfr SMT2CPWU;
__at(0x0DA6) volatile __SMT2CPWUbits_t SMT2CPWUbits;

__at(0x0DA7) __sfr SMT2PR;

__at(0x0DA7) __sfr SMT2PRL;
__at(0x0DA7) volatile __SMT2PRLbits_t SMT2PRLbits;

__at(0x0DA8) __sfr SMT2PRH;
__at(0x0DA8) volatile __SMT2PRHbits_t SMT2PRHbits;

__at(0x0DA9) __sfr SMT2PRU;
__at(0x0DA9) volatile __SMT2PRUbits_t SMT2PRUbits;

__at(0x0DAA) __sfr SMT2CON0;
__at(0x0DAA) volatile __SMT2CON0bits_t SMT2CON0bits;

__at(0x0DAB) __sfr SMT2CON1;
__at(0x0DAB) volatile __SMT2CON1bits_t SMT2CON1bits;

__at(0x0DAC) __sfr SMT2STAT;
__at(0x0DAC) volatile __SMT2STATbits_t SMT2STATbits;

__at(0x0DAD) __sfr SMT2CLK;
__at(0x0DAD) volatile __SMT2CLKbits_t SMT2CLKbits;

__at(0x0DAE) __sfr SMT2SIG;
__at(0x0DAE) volatile __SMT2SIGbits_t SMT2SIGbits;

__at(0x0DAF) __sfr SMT2WIN;
__at(0x0DAF) volatile __SMT2WINbits_t SMT2WINbits;

__at(0x0E0F) __sfr PPSLOCK;
__at(0x0E0F) volatile __PPSLOCKbits_t PPSLOCKbits;

__at(0x0E10) __sfr INTPPS;
__at(0x0E10) volatile __INTPPSbits_t INTPPSbits;

__at(0x0E11) __sfr T0CKIPPS;
__at(0x0E11) volatile __T0CKIPPSbits_t T0CKIPPSbits;

__at(0x0E12) __sfr T1CKIPPS;
__at(0x0E12) volatile __T1CKIPPSbits_t T1CKIPPSbits;

__at(0x0E13) __sfr T1GPPS;
__at(0x0E13) volatile __T1GPPSbits_t T1GPPSbits;

__at(0x0E14) __sfr CCP1PPS;
__at(0x0E14) volatile __CCP1PPSbits_t CCP1PPSbits;

__at(0x0E15) __sfr CCP2PPS;
__at(0x0E15) volatile __CCP2PPSbits_t CCP2PPSbits;

__at(0x0E16) __sfr ATINPPS;
__at(0x0E16) volatile __ATINPPSbits_t ATINPPSbits;

__at(0x0E17) __sfr CWGINPPS;
__at(0x0E17) volatile __CWGINPPSbits_t CWGINPPSbits;

__at(0x0E18) __sfr T2PPS;
__at(0x0E18) volatile __T2PPSbits_t T2PPSbits;

__at(0x0E19) __sfr T3CKIPPS;
__at(0x0E19) volatile __T3CKIPPSbits_t T3CKIPPSbits;

__at(0x0E1A) __sfr T3GPPS;
__at(0x0E1A) volatile __T3GPPSbits_t T3GPPSbits;

__at(0x0E1B) __sfr T4PPS;
__at(0x0E1B) volatile __T4PPSbits_t T4PPSbits;

__at(0x0E1C) __sfr T5CKIPPS;
__at(0x0E1C) volatile __T5CKIPPSbits_t T5CKIPPSbits;

__at(0x0E1D) __sfr T5GPPS;
__at(0x0E1D) volatile __T5GPPSbits_t T5GPPSbits;

__at(0x0E1E) __sfr T6PPS;
__at(0x0E1E) volatile __T6PPSbits_t T6PPSbits;

__at(0x0E1F) __sfr ATCC1PPS;
__at(0x0E1F) volatile __ATCC1PPSbits_t ATCC1PPSbits;

__at(0x0E20) __sfr SSPCLKPPS;
__at(0x0E20) volatile __SSPCLKPPSbits_t SSPCLKPPSbits;

__at(0x0E21) __sfr SSPDATPPS;
__at(0x0E21) volatile __SSPDATPPSbits_t SSPDATPPSbits;

__at(0x0E22) __sfr SSPSSPPS;
__at(0x0E22) volatile __SSPSSPPSbits_t SSPSSPPSbits;

__at(0x0E23) __sfr ATCC2PPS;
__at(0x0E23) volatile __ATCC2PPSbits_t ATCC2PPSbits;

__at(0x0E24) __sfr RXPPS;
__at(0x0E24) volatile __RXPPSbits_t RXPPSbits;

__at(0x0E25) __sfr CKPPS;
__at(0x0E25) volatile __CKPPSbits_t CKPPSbits;

__at(0x0E26) __sfr SMT1SIGPPS;
__at(0x0E26) volatile __SMT1SIGPPSbits_t SMT1SIGPPSbits;

__at(0x0E27) __sfr SMT1WINPPS;
__at(0x0E27) volatile __SMT1WINPPSbits_t SMT1WINPPSbits;

__at(0x0E28) __sfr CLCIN0PPS;
__at(0x0E28) volatile __CLCIN0PPSbits_t CLCIN0PPSbits;

__at(0x0E29) __sfr CLCIN1PPS;
__at(0x0E29) volatile __CLCIN1PPSbits_t CLCIN1PPSbits;

